package BasisStudy;

/**
 * 与 或 左、右移  无符号左、右移
 */
public class Demo26 {
    public static void main(String[] args) {
        int a = 200;
        int b = 10;


        /* 与 & 运算
            0000 0000 0000 0000 0000 0000 1100 1000
          & 0000 0000 0000 0000 0000 0000 0000 1010
          --------------------------------------------
            0000 0000 0000 0000 0000 0000 0000 1000     装换为十进制：8
         */
        System.out.println( a & b );


         /* 或 | 运算
            0000 0000 0000 0000 0000 0000 1100 1000
          | 0000 0000 0000 0000 0000 0000 0000 1010
          --------------------------------------------
            0000 0000 0000 0000 0000 0000 1100 1010     装换为十进制：202
         */
        System.out.println( a | b);


        /* 右移 >> 运算
            0000 0000 0000 0000 0000 0000 1100 1000
         右移两位后变为：
            0000 0000 0000 0000 0000 0000 0011 0010   转换为十进制：2+16+32 = 50 实际上就是右移几位除以几次2
         */
        System.out.println( a >> 2 );

        /* 左移 << 运算
            0000 0000 0000 0000 0000 0000 1100 1000
         右移两位后变为：
            0000 0000 0000 0000 0000 0011 0010 0000   转换为十进制：32+256+512 = 800  实际上就是左移几位乘以几次2
         */
        System.out.println( a << 2 );



    }
}
